import React, { useState } from "react";

function TestOne() {
    const [tasks, setTasks] = useState([]);
        const [newTask, setNewTask] = useState('');
    
        const addTask = () => {
            if (newTask.trim() !== "") {
                setTasks([...tasks, newTask]);
                setNewTask('');
            }
        };
    
        return (
            <div className="page">
                <h4 className="test-text">
                    Абай Құнанбаев — қазақ халқының ұлы ақыны, ағартушысы және ойшылы. Оның шығармашылығы қазақ әдебиетінің жаңа дәуірін бастап берді. Абайдың «Қара сөздері» мен өлеңдері — бүкіл адамзатқа арналған рухани қазына. Ол өз шығармаларында адамгершілік, білім, ғылым және еңбек туралы терең ой толғады.

                    Ақынның басты мақсаты — жастарды оқуға, талпынуға және ізгілікке шақыру болды. «Ғылым таппай мақтанба» деп, білімнің адам өміріндегі маңызын дәріптеді. Сонымен қатар, ол халықтың бойындағы жағымсыз қасиеттерді сынап, олардан арылуға үндеді. Абайдың поэзиясы — нәзік сезім мен терең философияның үйлесімі.

                    Бүгінгі таңда Абай мұрасы — ұлттық болмысымыздың айқын көрсеткіші. Оның өнегелі сөздері әрбір қазақстандықтың жүрегінде сақтаулы. Абай — тек қазақтың ғана емес, әлемдік деңгейдегі ұлы тұлға. Оның есімі мен шығармалары уақыт өткен сайын жаңа мағынаға ие болып, болашақ ұрпаққа рухани азық бола береді. Абайды тану — өзіңді тану деген сөз.
                </h4>
                <h2 className="test-title">Бейнеде не болғанын қысқаша сипаттаңыз.</h2>
                <ul className="test-ul">
                    {tasks.map((task, index) => (
                        <li key={index}>{task}</li>
                    ))}
                </ul>
                <input 
                    onChange={(e) => setNewTask(e.target.value)} 
                    value={newTask} 
                    type="text" 
                    placeholder="Введи предложение"
                    className="test-input"
                />
                <button onClick={addTask} className="test-button">Отправить</button>
            </div>
        );
}

export default TestOne;