import React, { useState } from "react";

function TestTwo() {
    const [tasks, setTasks] = useState([]);
    const [newTask, setNewTask] = useState('');

    const addTask = () => {
        if (newTask.trim() !== "") {
            setTasks([...tasks, newTask]);
            setNewTask('');
        }
    };

    return (
        <div className="page">
            <h4 className="test-text">
                Футболдан әлем чемпионаты — төрт жылда бір рет өтетін жаһандық деңгейдегі ең ірі спорттық жарыс. Бұл турнир миллиондаған жанкүйерді біріктіріп, ұлттық құрамалардың шеберлігін бағалауға мүмкіндік береді. Чемпионат тарихында Бразилия, Германия және Италия секілді елдер өздерінің жоғары нәтижелерімен ерекшеленген. Футбол тек ойын емес, ол — достық пен бәсекелестіктің, еңбек пен табандылықтың символы. 

                Әрбір чемпионат жаңа жұлдыздардың жарқырауына және тарихи сәттердің орын алуына себеп болады. Ойыншылар алаңда бар күш-жігерін салып, өз елінің намысын қорғайды. Жанкүйерлер үшін бұл — нағыз мереке, ал футболшылар үшін — спорттық мансаптың шыңы. Чемпионаттың атмосферасы ерекше: стадиондардағы айқай, ойыншылардың эмоциясы және жанкүйерлердің қолдауы — барлығы спорттың құдіретін көрсетеді. Футбол әлемі әрқашан тосынсыйлар мен қызықты оқиғаларға толы, ал әлем чемпионаты осының барлығын бір жерге тоғыстырады.
            </h4>
            <h2 className="test-title">Футболдан әлем чемпионаты туралы өз пікіріңізді жазыңыз.</h2>
            <ul className="test-ul">
                {tasks.map((task, index) => (
                    <li key={index}>{task}</li>
                ))}
            </ul>
            <input 
                onChange={(e) => setNewTask(e.target.value)} 
                value={newTask} 
                type="text" 
                placeholder="Введи предложение"
                className="test-input"
            />
            <button onClick={addTask} className="test-button">Отправить</button>
        </div>
    );
}

export default TestTwo;